)ATTR default(%+_)
@ type( input) intens(high) caps(on ) just(left ) hilite(uscore) color(turq)
` type(text) intens(high) caps(off) just(asis ) color(yellow)
~ type(text) intens(high) caps(off) just(asis ) color(turq)
% type(text) intens(high)
# type(text) intens(high) color(turq) hilite(reverse)
)BODY
                            #FTP Data Set Select+
%Command ===>_ZCMD
+
+This selection table allows you to select data sets to be transfered
+using FTP from the remote system to this system.
+
+Available line commands are:
+
+  `S+to Select the dataset (Get)
+  `U+to UnSelect or UnExclude a data set
+
`Notes:+
+Data sets that are in MIGRAT status will`are+not eligible for processing.
+
+
+
+
+
+
+
+
)INIT
)END
