)ATTR
  ` type(text) intens(high) caps(off) just(asis ) color(yellow)
  ~ type(text) intens(high) caps(off) just(asis ) color(turq)
  % type(text) intens(high)
  @ type(text) intens(high) color(turq) hilite(reverse)
)Body Window(62,12)
+
`Direction+
+
~Specifies if the FTP will be used to%Put~(default) the
~specified dataset(s) to the remote site,%Get~them
~from the remote site, or%Sync~two partitioned datasets.
~
%Get~is only valid when z/OS is%Yes~at this time and only
~Partitioned (PDS) and Sequential (PS) datasets are supported.
~
%G~denotes Get,%P~denotes Put, and%S~denotes Sync.
~
)INIT
 &zwinttl = 'FTP Transfer Direction'
 &zcont = ftpbhf2
 &zup   = ftpbhf3
)PROC
)END
