)ATTR
  ` type(text) intens(high) caps(off) just(asis ) color(yellow)
  ~ type(text) intens(high) caps(off) just(asis ) color(turq)
  % type(text) intens(high)
  @ type(text) intens(high) color(turq) hilite(reverse)
)BODY WINDOW(63,17)
+
`Hostname+
+
~This input field defines the TCP/IP Host Name of the Remote
~system or host that the Local Data Set will be copied to. The
~key to a host name is that it references a system that is
~part of the DASD complex where you want the data set(s) to be
~copied.
~
~If%?~is used then you will be prompted with table display of
~all previously used hostnames from which you may select from
~1 to n.  You can also Clone, Update, and delete hostnames.
~
`Examples:
+
~  prod.company.com    + Production LPAR
~  test.company.com    + Test LPAR
)INIT
 &zwinttl = 'FTP Hostname Option'
 &zcont = ftpbhf12
 &zup   = ftpbhf2
)PROC
)END
