)ATTR default(%+_)
  ` type(text) intens(high) caps(off) just(asis ) color(yellow)
  ~ type(text) intens(high) caps(off) just(asis ) color(turq)
  % type(text) intens(high)
  # type(text) intens(high) color(turq) hilite(reverse)
)Body Window(74,20)
+
`Remote Data Set+
+
~This input field is optional and if used defines the new name of the
~Local Data Set. Or for non-z/OS the new file name.
~
~If the Direction is%Get~then this field may be used to specify the
~Local HLQ to use.
~
~No validity check is made until execution time for this field.
~
~This field can also contain a remote drive:\directory\filename
~for workstation remotes. (e.g. c:\t\newname.txt)
~
`Examples:
+
~  userid.TEST.CLIST         + new name for input library
~  userid.TEST.**            + new name for input library mask
~  \u\directory\file         + uss location and file
~  c:\temp\newname.txt       + drive 'c' directory temp w/newname
)INIT
 &zwinttl = 'FTP Remote Data Set'
 &zcont = ftpbhfd
 &zup   = ftpbhf2
)END
