)ATTR default(%+_)
  ` type(text) intens(high) caps(off) just(asis ) color(yellow)
  ~ type(text) intens(high) caps(off) just(asis ) color(turq)
  % type(text) intens(high)
  # type(text) intens(high) color(turq) hilite(reverse)
)BODY window(66,19)
+
`Target Data Set+
+
~This input field is optional and if used defines the new
~name of the Source Data Set on the remote system.  Or for
~non-z/OS the new file name.
~
~No validity check is made until execution time for this field.
~
~This field can also contain a target drive:\directory\filename
~for workstation targets. (e.g. c:\t\newname.txt)
~
`Examples:
+
~  userid.TEST.CLIST         + new name for input library
~  userid.TEST.**            + new name for input library mask
~  \u\directory\file         + uss location and file
~  c:\temp\newname.txt       + drive 'c' directory temp w/newname
)INIT
 &zwinttl = 'FTP Target Data Set'
 &zcont = ftpbhf12
 &zup   = ftpbhf2
)END
