)ATTR default(%+_)
@ type( input) intens(high) caps(on ) just(left ) hilite(uscore) color(turq)
` type(text) intens(high) caps(off) just(asis ) color(yellow)
~ type(text) intens(high) caps(off) just(asis ) color(turq)
% type(text) intens(high)
# type(text) intens(high) color(turq) hilite(reverse)
)BODY WINDOW(50,12)
+
`Firewall+
~
~If you are going to FTP your data outside the
~company you will have to pass thru a firewall. A
~firewall protects the internal TCP/IP environment
~from the 'world'.
~
~When you specify#yes~to Firewall then the address
~you define will be used.
)INIT
 &zwinttl = 'FTP Firewall option'
 &zcont = ftpbhf9
 &zup   = ftpbhf7
)END
