)ATTR default(%+_)
@ type( input) intens(high) caps(on ) just(left ) hilite(uscore) color(turq)
` type(text) intens(high) caps(off) just(asis ) color(yellow)
~ type(text) intens(high) caps(off) just(asis ) color(turq)
% type(text) intens(high)
# type(text) intens(high) color(turq) hilite(reverse)
)Body Window(59,7)
+
`z/OS+
~
~If the Remote system is another z/OS system then
~specify%Yes~otherwise specify%No~to indicate that the
~transfer should not use the z/OS optimized parameters.
~
)INIT
 &zwinttl = 'FTP z/OS Option'
 &zcont = ftpbhf7
 &zup   = ftpbhf13
)END
