)ATTR default(%+_)
@ type( input) intens(high) caps(on ) just(left ) hilite(uscore) color(turq)
` type(text) intens(high) caps(off) just(asis ) color(yellow)
~ type(text) intens(high) caps(off) just(asis ) color(turq)
% type(text) intens(high)
# type(text) intens(high) color(turq) hilite(reverse)
)Body Window(59,10)
+
`z/OS+
~
~If the target (remote) system is another z/OS system
~then specify%yes~otherwise specify%no~to indicate that
~the transfer should not use the z/OS optimized parameters.
~
~To Compare the directories specify%Sync~to enable
~getting members from the remote site.
~
)INIT
 &zwinttl = 'FTP z/OS Option'
 &zcont = ftpbhf7
 &zup   = ftpbhf13
)END
