)ATTR default(%+_)
@ type( input) intens(high) caps(on ) just(left ) hilite(uscore) color(turq)
` type(text) intens(high) caps(off) just(asis ) color(yellow)
~ type(text) intens(high) caps(off) just(asis ) color(turq)
% type(text) intens(high)
# type(text) intens(high) color(turq) hilite(reverse)
)BODY WINDOW(50,10)

`Post Commands+
~
~This field allows you to enter 1 optional FTP
~subcommands that will be processed after the FTP
~PUT command is processed to do the transfer.  See
~the TCP/IP documentation for a list of valid
~subcommands and descriptions.
)INIT
 &zwinttl = 'FTP Post Command'
 &zcont = ftpbh0
 &zup   = ftpbhf9
)END
