)ATTR default(%+_)
@ type( input) intens(high) caps(on ) just(left ) hilite(uscore) color(turq)
` type(text) intens(high) caps(off) just(asis ) color(yellow)
~ type(text) intens(high) caps(off) just(asis ) color(turq)
% type(text) intens(high)
# type(text) intens(high) color(turq) hilite(reverse)
)BODY WINDOW(50,8)

`TLS option+
~
~This field allows you to enable a Secure FTP
~transfer using Transport Level Security.
+
~Yes or No.
)INIT
 &zwinttl = 'FTP TLS Option'
 &zcont = ftpbhf4
 &zup   = ftpbhf12
)END
