)ATTR default(%+_)
@ type( input) intens(high) caps(on ) just(left ) hilite(uscore) color(turq)
` type(text) intens(high) caps(off) just(asis ) color(yellow)
~ type(text) intens(high) caps(off) just(asis ) color(turq)
% type(text) intens(high)
# type(text) intens(high) color(turq) hilite(reverse)
)BODY WINDOW(62,17)
+
`Source Data Set+
+
~This input field defines the input data set name that will
~be copied using FTP from the current system to the defined
~target (remote) host.
+
`Examples:
+
~  TEST.CLIST                + prompt for members if PDS
~  'hlq.TEST.CLIST(*)'       + send all members of PDS
~  'hlq.TEST.CLIST(AB*)      + prompt members AB* only
~  userid.TEST.**            + send all data sets that start
                             +    with userid.TEST
~  /u/directory/file         + file in uss (use * for mask)
+
+Note: This field can be scrolled left/right for longer names
)INIT
 &zwinttl = 'FTP Source Data Set'
 &zcont = ftpbhf2
 &zup   = ftpbh0
)END
