)ATTR default(%+_)
@ type( input) intens(high) caps(on ) just(left ) hilite(uscore) color(turq)
` type(text) intens(high) caps(off) just(asis ) color(yellow)
~ type(text) intens(high) caps(off) just(asis ) color(turq)
% type(text) intens(high)
# type(text) intens(high) color(turq) hilite(reverse)
)BODY WINDOW(50,7)

`Port option+
~
~This field allows you to specify the PORT to be
~used at the Remote host. 21 is the default.
+
)INIT
 &zwinttl = 'FTP Port Option'
 &zcont = ftpbhf11
 &zup   = ftpbhf3
)END
