)ATTR default(%+_)
@ type( input) intens(high) caps(on ) just(left ) hilite(uscore) color(turq)
` type(text) intens(high) caps(off) just(asis ) color(yellow)
~ type(output) intens(high) caps(off) just(asis ) color(turq)
% type(text) intens(high)
# type(text) intens(high) color(turq) hilite(reverse)
)BODY
                #Patience - Building List of Eligible Data Sets+
%Command ===>_ZCMD

 #Patience+     #Patience+     #Patience+     #Patience+     #Patience+

           `The dialog is building a list of eligible data sets
           `which may take some time depending on how generic
           `your selection criteria is.

  `Selection pattern: ~ldsname
)INIT
)END
/* 2024-01-03  MRM  2.032 Variables sdsname->ldsname, tdsname->rdsname        */
/*                        From/To nomenclature changed to Local/Remote        */
