)ATTR default(%+_)
@ type( input) intens(high) caps(on ) just(left ) hilite(uscore) color(turq)
` type(text) intens(high) caps(off) just(asis ) color(yellow)
~ type(text) intens(high) caps(off) just(asis ) color(turq)
% type(text) intens(high)
# type(text) intens(high) color(turq) hilite(reverse)
)BODY WINDOW(50,10)
+
`Initial Commands+
~
~These fields allow you to enter 2 optional FTP
~subcommands that will be processed before the FTP
~PUT command is processed to do the transfer.  See
~the TCP/IP documentation for a list of valid
~subcommands and descriptions.
)INIT
 &zwinttl = 'FTP Initial Commands'
 &zcont = ftpbhf10
 &zup   = ftpbhf8
)END
