)ATTR default(%+_)
@ type( input) intens(high) caps(on ) just(left ) hilite(uscore) color(turq)
` type(text) intens(high) caps(off) just(asis ) color(yellow)
~ type(text) intens(high) caps(off) just(asis ) color(turq)
% type(text) intens(high)
# type(text) intens(high) color(turq) hilite(reverse)
)BODY WINDOW(51,7)

`Passive option
~
~This field allows you to configure FTP for Passive
~mode. This is also known as Firewall Friendly.
+
~Yes (default) or No.
)INIT
 &zwinttl = 'FTP Passive Option'
 &zcont = ftpbhf6
 &zup   = ftpbhf13
)END
