)ATTR default(%+_)
@ type(output) intens(high) color(white) just(left)
` type(text) intens(high) caps(off) just(asis ) color(yellow)
~ type(text) intens(high) caps(off) just(asis ) color(turq)
% type(text) intens(high)
# type(text) intens(high) color(turq) hilite(reverse)
)Body Window(56,8)
`Transfer Options:
~
~Unload No:+ The PDS members will be processed using FTP
~
~Unload Yes:+The PDS members will be processed using
+            IEBCOPY to unload them. Then the unload
+            will be sent using FTP, and then reloaded.
+            All in Batch.
)INIT
 &zwinttl = 'FTP Unload Option'
)END
