)ATTR default(%+_)
@ type( input) intens(high) caps(on ) just(left ) hilite(uscore) color(turq)
` type(text) intens(high) caps(off) just(asis ) color(yellow)
~ type(text) intens(high) caps(off) just(asis ) color(turq)
% type(text) intens(high)
# type(output) intens(high)
)Body Window(59,18)
+
`NETRC option
+
+This field allows you to specify your personal NETRC
+data set, or data set member, to be used.
+
+NOTES:%RACF+Protection
  +Issue%ADDSD netrc-dsn UACC(NONE)
+  and%PERMIT netrc-dsn ACCESS(ALTER)#puid
+
+NOTES:%ACF2+Protection
  +Issue%ACFNRULE KEY(hlq)
%  ADD( netrc-dsn-after-key UID(...userid) READ(A) WRITE(A)
+
+NETRC Format:
%MACHINE hostname LOGIN userid PASSWORD password
%MACHINE i.p.addr LOGIN userid PASSWORD password
+
)INIT
 &zwinttl = 'FTP NETRC Option'
 &zcont = ftpbhf6
 &zup   = ftpbhf5
*REXX(*)
 puid = 'ID('sysvar('sysuid')')'
*ENDREXX
)END
