)ATTR default(%+_)
@ type( input) intens(high) caps(on ) just(left ) hilite(uscore) color(turq)
` type(text) intens(high) caps(off) just(asis ) color(yellow)
~ type(output) intens(high) caps(off) just(asis ) color(turq)
% type(text) intens(high)
# type(text) intens(high) color(turq) hilite(reverse)
)BODY
               #Patience - Calculating the Space Requirements+
%Command ===>_ZCMD

 #Patience+     #Patience+     #Patience+     #Patience+     #Patience+

           `The dialog is calculating the temporary space
           `required for the unload of the selected data sets.

)INIT
)END
