)ATTR default(%+_)
@ type( input) intens(high) caps(on ) just(left ) hilite(uscore) color(turq)
` type(text) intens(high) caps(off) just(asis ) color(yellow)
~ type(text) intens(high) caps(off) just(asis ) color(turq)
% type(text) intens(high)
# type(text) intens(high) color(turq) hilite(reverse)
)BODY
                            #FTP Data Set Select+
%Command ===>_ZCMD

+This selection table allows you to select`or+exclude data sets to be
+transfered using FTP from this system to another.  ADRDSSU (aka DFSMSdss)
+is used to unload all eligible data sets into a sequential file to be
+sent via FTP and then reloaded at the remote system.
+
`Notes:+
+Data sets that are in MIGRAT status will`are+not eligible for processing.
+No`Selections+or`Exclusions+will cause all eligible data sets to be processed.
`Select+and`Exclude+are mutually exclusive.
+
+Available line commands are:
+
 `E+to Exclude a data set                `S+to Select a dataset
 `M+to Migrate a data set using DFSMShsm `U+to UnSelect or UnExclude a data set
 `R+to Recall a data set using DFSMShsm
+
+See the DFSMSdss documentation for further information on Select (Include)
+or Exclude processing.
)INIT
)END
